### Menggabungkan dua data frame

In [1]:
import pandas as pd
import numpy as np

print (pd.__version__)
print(np.__version__)

1.2.4
1.20.1

In [2]:
n_rows=5
n_cols=5
cols=tuple('ABCDE')
#Membuat sebuah bentuk data grame 
#Memakai random integer mulai dari angka 1 -20,size untuk menentukanjumlah baris cols= tuple 
df=pd.DataFrame(np.random.randint(1, 20, size=(n_rows,n_cols)),columns=cols)
df.head()

    A   B   C   D   E
0   1  17  11   6  13
1   8   6  14  12   7
2  15  15  10  11  17
3  15  19  14  18  18
4   6  11   3   3   5

In [3]:
df1=df.copy(deep= True)
df1=df1.drop([1,4])

df1

    A   B   C   D   E
0   1  17  11   6  13
2  15  15  10  11  17
3  15  19  14  18  18

In [5]:
df2=df.copy(deep=True)
df2 =df2.drop([1,4])
df2

    A   B   C   D   E
0   1  17  11   6  13
2  15  15  10  11  17
3  15  19  14  18  18

### Menggabungkan dua data frame

In [6]:
df_inner =pd.merge(df1,df2,how='inner')
df_inner

    A   B   C   D   E
0   1  17  11   6  13
1  15  15  10  11  17
2  15  19  14  18  18

In [7]:
df_outer=pd.merge(df1,df2,how='outer')
df_outer

    A   B   C   D   E
0   1  17  11   6  13
1  15  15  10  11  17
2  15  19  14  18  18